Revit 2027 API
VoltageTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual VoltageTypeSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As VoltageTypeSetIterator
public:
virtual VoltageTypeSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> VoltageTypeSetIterator
override ForwardIterator : unit -> VoltageTypeSetIterator
Return Value
VoltageTypeSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
VoltageTypeSet Class
Autodesk.Revit.DB.Electrical Namespace